all_connectors = ['וכן', 'או', 'כפי', 'כשם', 'גם', 'אף', 'כמו', 'כן', 'יתר', 'על', 'זאת', 'ועוד', 'נוסף', 'כך', 'מעבר',
                   'לכך', 'ואילו', 'לעומת', 'בעוד', 'למרות', 'חרף', 'אף', 'פי',
                   'אם', 'אבל', 'אך', 'אולם', 'ברם', 'בניגוד', 'בשעה', 'כאשר', 'לפני', 'לאחר', 'במידה', 'ככל', 'עד',
                   'כדי',
                   'מפני', 'משום', 'מפאת', 'בגלל', 'לאור', 'בגין', 'היות',
                    'בשל', 'עקב', 'בעקבות', 'בזכות', 'לרגל', 'לנוכח', 'לשם', 'מנת', 'פן', 'שמא', 'לבל',
                   'בשביל', 'במקרה', 'אילולא', 'אלמלא', 'אילו', 'לו', 'בתנאי',
                   'אלא', 'ולא', 'כידוע', 'כאמור', 'כנזכר', 'לעיל', 'כזכור', 'כלומר', 'אומרת', 'לא', 'כל', 'שכן',
                   'משמע',
                   'דהיינו', 'למשל', 'כגון', 'לדוגמה', 'במילים', 'אחרות',
                   'פירושו', 'של', 'דבר', 'דהיינו', 'משמע', 'אכן', 'אומנם', 'בייחוד', 'יש', 'להדגיש', 'ללא', 'ספק',
                   'ראשית',
                   'שנית', 'תחילה', 'לבסוף', 'החל', 'אלו', 'לסיכום',
                   'לסיכומו', 'נראה', 'אפוא', 'משתמע', 'מכך', 'יתרה', 'מזו', 'במרוצת', 'בתחילת', 'בסוף',
                   'בתום',
                   'בשלהי', 'בימי', 'בתקופת', 'בקרוב', 'מעולם', 'לעולם', 'לימים',
                   'באחרונה', 'עדיין', 'כבר', 'טרם', 'לאחר', 'מכן', 'לפני', 'כמה', 'וכמה', 'קל']


opening_connectors = ['הרעיון המרכזי של הטקסט הוא ש', 'מאמר מדבר על זה ש', 'ידוע כ', 'ראשית,']
adding_connectors = ['וכן', 'גם', 'אף', 'כמו כן', 'יתר על כן', 'זאת ועוד', 'נוסף על כך', 'מעבר לכך', 'יש להדגיש']
ending_connectors = ['לסיכום', 'לבסוף', 'מן המאמר ניתן לומר כי', 'לסיום']